In [0]:
# import pandas
import pandas as pd

Pandas Series
 pandas.Series(data=None, index=None, dtype=None, name=None, copy=False, fastpath=False)

Parameters

    dataarray-like, Iterable, dict, or scalar value

        Contains data stored in Series.

        Changed in version 0.23.0: If data is a dict, argument order is maintained for Python 3.6 and later.
    indexarray-like or Index (1d)

        Values must be hashable and have the same length as data. Non-unique index values are allowed. Will default to RangeIndex (0, 1, 2, …, n) if not provided. If both a dict and index sequence are used, the index will override the keys found in the dict.
    dtypestr, numpy.dtype, or ExtensionDtype, optional

        Data type for the output Series. If not specified, this will be inferred from data. See the user guide for more usages.
    namestr, optional

        The name to give to the Series.
    copybool, default False

        Copy input data.
Source:https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.html

In [12]:
# create a serie
label = ['This','is','AI','path']
num = [1,2,3,4]
# they must be same size
pd_serie = pd.Series(label,num)
pd_serie
# check the data type

1    This
2      is
3      AI
4    path
dtype: object

In [14]:
# and another way
pd_serie1 = pd.Series(label,[6,7,8,9])
pd_serie1

6    This
7      is
8      AI
9    path
dtype: object

In [22]:
exam1 = {'ahmet':50,'mike':60,'rania':75}
S1 = pd.Series(exam1)
S1

ahmet    50
mike     60
rania    75
dtype: int64

In [23]:
exam2 = {'ahmet':90}
S2 =pd.Series(exam2)
S2

ahmet    90
dtype: int64

In [26]:
exam3 = {'chirag':100}
S3 = pd.Series(exam3)
S3

chirag    100
dtype: int64

In [29]:
S1+S2 #-,/,* ...
# NaN = Not a numbe

ahmet    140.0
mike       NaN
rania      NaN
dtype: float64

In [31]:
exam4 = S3.append(S1)
exam4

chirag    100
ahmet      50
mike       60
rania      75
dtype: int64

In [37]:
S1['ahmet'],exam4['mike']

(50, 60)

 Pandas DataFrame
 
 class pandas.DataFrame(data=None, index: Optional[Collection] = None, columns: Optional[Collection] = None, dtype: Union[str, numpy.dtype, ExtensionDtype, None] = None, copy: bool = False)[source]

    Two-dimensional, size-mutable, potentially heterogeneous tabular data.

    Data structure also contains labeled axes (rows and columns). Arithmetic operations align on both row and column labels. Can be thought of as a dict-like container for Series objects. The primary pandas data structure.

    Parameters

        datandarray (structured or homogeneous), Iterable, dict, or DataFrame

            Dict can contain Series, arrays, constants, or list-like objects.

            Changed in version 0.23.0: If data is a dict, column order follows insertion-order for Python 3.6 and later.

            Changed in version 0.25.0: If data is a list of dicts, column order follows insertion-order for Python 3.6 and later.
        indexIndex or array-like

            Index to use for resulting frame. Will default to RangeIndex if no indexing information part of input data and no index provided.
        columnsIndex or array-like

            Column labels to use for resulting frame. Will default to RangeIndex (0, 1, 2, …, n) if no column labels are provided.
        dtypedtype, default None

            Data type to force. Only a single dtype is allowed. If None, infer.
        copybool, default False

            Copy data from inputs. Only affects DataFrame / 2d ndarray input.

source: https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.html

In [85]:
# firstly crea a data
from numpy.random import randn
# create dataframe
df1 = pd.DataFrame(data = randn(5,5),index=['1','2','3','4','5'],columns=['co1','co2','co3','co4','co5'])
df1

        co1       co2       co3       co4       co5
1 -1.057639  1.991441 -0.868973  1.092407  1.319686
2 -0.482499  0.958889 -0.670147  0.639030  0.042469
3 -0.482799 -1.350396  0.743166  0.522170 -0.839910
4 -1.421708 -0.021159  1.322086  0.670611 -0.700592
5 -0.519985 -0.607833 -0.975219 -1.060410 -0.423812

In [86]:
# read any column/columns
df1[['co1','co2']]

        co1       co2
1 -1.057639  1.991441
2 -0.482499  0.958889
3 -0.482799 -1.350396
4 -1.421708 -0.021159
5 -0.519985 -0.607833

In [87]:
# add any column/columns
df1['co6']= pd.Series(randn(5),['1','2','3','4','5'])
df1

        co1       co2       co3       co4       co5       co6
1 -1.057639  1.991441 -0.868973  1.092407  1.319686 -0.222046
2 -0.482499  0.958889 -0.670147  0.639030  0.042469  2.462191
3 -0.482799 -1.350396  0.743166  0.522170 -0.839910 -1.629911
4 -1.421708 -0.021159  1.322086  0.670611 -0.700592 -0.244058
5 -0.519985 -0.607833 -0.975219 -1.060410 -0.423812 -0.216001

In [88]:
# add any column/columns
df1['co7'] =(df1['co1']+ df1['co4']-df1['co3']*df1['co5'])/df1['co6']
df1

        co1       co2       co3       co4       co5       co6       co7
1 -1.057639  1.991441 -0.868973  1.092407  1.319686 -0.222046 -5.321144
2 -0.482499  0.958889 -0.670147  0.639030  0.042469  2.462191  0.075133
3 -0.482799 -1.350396  0.743166  0.522170 -0.839910 -1.629911 -0.407116
4 -1.421708 -0.021159  1.322086  0.670611 -0.700592 -0.244058 -0.717644
5 -0.519985 -0.607833 -0.975219 -1.060410 -0.423812 -0.216001  9.230085

In [89]:
# exit/drop any column/columns
df1.drop('co3',axis=1,inplace=True)
df1
# axis=0:row,axis=1:column
# inplace= True:permanently delete,False:delete temporarily

        co1       co2       co4       co5       co6       co7
1 -1.057639  1.991441  1.092407  1.319686 -0.222046 -5.321144
2 -0.482499  0.958889  0.639030  0.042469  2.462191  0.075133
3 -0.482799 -1.350396  0.522170 -0.839910 -1.629911 -0.407116
4 -1.421708 -0.021159  0.670611 -0.700592 -0.244058 -0.717644
5 -0.519985 -0.607833 -1.060410 -0.423812 -0.216001  9.230085

In [0]:
# seta column name to index name
df1.set_index('co6',inplace=True)
df1

In [90]:
# df1.index.names
df1.columns.names

FrozenList([None])

In [91]:
# 'loc' and 'iloc'
df1.loc['5'] #by column name
df1.iloc[4] #by column index (start from 0)

co1   -0.519985
co2   -0.607833
co4   -1.060410
co5   -0.423812
co6   -0.216001
co7    9.230085
Name: 5, dtype: float64

In [96]:
df1.loc['2','co7']
df1.loc[['2','co7'] and ['4','co6']] #or...
df1.loc[['2','co7'], ['col2','co6']]

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:2: FutureWarning:
Passing list-likes to .loc or [] with any missing label will raise
KeyError in the future, you can use .reindex() as an alternative.

See the documentation here:
https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#deprecate-loc-reindex-listlike

/usr/local/lib/python3.6/dist-packages/pandas/core/indexing.py:1418: FutureWarning:
Passing list-likes to .loc or [] with any missing label will raise
KeyError in the future, you can use .reindex() as an alternative.

See the documentation here:
https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#deprecate-loc-reindex-listlike
  return self._getitem_tuple(key)

     col2       co6
2     NaN  2.462191
co7   NaN       NaN

In [98]:
df1
df1>1

     co1    co2    co4    co5    co6    co7
1  False   True   True   True  False  False
2  False  False  False  False   True  False
3  False  False  False  False  False  False
4  False  False  False  False  False  False
5  False  False  False  False  False   True

In [104]:
boolDf = df1>0
boolDf

     co1    co2    co4    co5    co6    co7
1  False   True   True   True  False  False
2  False   True   True   True   True   True
3  False  False   True  False  False  False
4  False  False   True  False  False  False
5  False  False  False  False  False   True

In [106]:
df1[boolDf]
# NaN mean False

   co1       co2       co4       co5       co6       co7
1  NaN  1.991441  1.092407  1.319686       NaN       NaN
2  NaN  0.958889  0.639030  0.042469  2.462191  0.075133
3  NaN       NaN  0.522170       NaN       NaN       NaN
4  NaN       NaN  0.670611       NaN       NaN       NaN
5  NaN       NaN       NaN       NaN       NaN  9.230085

In [108]:
df1[df1>0.5]

   co1       co2       co4       co5       co6       co7
1  NaN  1.991441  1.092407  1.319686       NaN       NaN
2  NaN  0.958889  0.639030       NaN  2.462191       NaN
3  NaN       NaN  0.522170       NaN       NaN       NaN
4  NaN       NaN  0.670611       NaN       NaN       NaN
5  NaN       NaN       NaN       NaN       NaN  9.230085

In [110]:
df1['co4']>0

1     True
2     True
3     True
4     True
5    False
Name: co4, dtype: bool

In [112]:
df1[df1['co2']>0]

        co1       co2       co4       co5       co6       co7
1 -1.057639  1.991441  1.092407  1.319686 -0.222046 -5.321144
2 -0.482499  0.958889  0.639030  0.042469  2.462191  0.075133

In [113]:
df1[df1['co4']>0]

        co1       co2       co4       co5       co6       co7
1 -1.057639  1.991441  1.092407  1.319686 -0.222046 -5.321144
2 -0.482499  0.958889  0.639030  0.042469  2.462191  0.075133
3 -0.482799 -1.350396  0.522170 -0.839910 -1.629911 -0.407116
4 -1.421708 -0.021159  0.670611 -0.700592 -0.244058 -0.717644

In [116]:
df1[df1['co6']>0]

        co1       co2      co4       co5       co6       co7
2 -0.482499  0.958889  0.63903  0.042469  2.462191  0.075133

In [117]:
df1[df1['co1']>0]

Empty DataFrame
Columns: [co1, co2, co4, co5, co6, co7]
Index: []

In [126]:
df1[(df1['co2']>0)&(df1['co7']>0)]

        co1       co2      co4       co5       co6       co7
2 -0.482499  0.958889  0.63903  0.042469  2.462191  0.075133

In [128]:
df1[(df1['co2']>0)|(df1['co7']>1)]

        co1       co2       co4       co5       co6       co7
1 -1.057639  1.991441  1.092407  1.319686 -0.222046 -5.321144
2 -0.482499  0.958889  0.639030  0.042469  2.462191  0.075133
5 -0.519985 -0.607833 -1.060410 -0.423812 -0.216001  9.230085

In [0]:
# summary: Values that are 'true' are displayed and you can't use and/or instead of that |,&

In [130]:
df1

        co1       co2       co4       co5       co6       co7
1 -1.057639  1.991441  1.092407  1.319686 -0.222046 -5.321144
2 -0.482499  0.958889  0.639030  0.042469  2.462191  0.075133
3 -0.482799 -1.350396  0.522170 -0.839910 -1.629911 -0.407116
4 -1.421708 -0.021159  0.670611 -0.700592 -0.244058 -0.717644
5 -0.519985 -0.607833 -1.060410 -0.423812 -0.216001  9.230085

In [0]:
df1['co7'] = ['NewVal1','NewVal2','NewVal3','NewVal4','NewVal5',]

In [0]:
df1.set_index('co7',inplace=True)

In [141]:
df1.index.names

FrozenList(['co7'])

In [142]:
df1.columns.names

FrozenList([None])

In [144]:
# Multi Index
OuterIndex = ['Group1','Group1','Group1','Group2','Group2','Group2','Group3','Group3','Group3']
InnerIndex = ['Index1','Index2','Index3','Index1','Index2','Index3','Index1','Index2','Index3']
list(zip(OuterIndex,InnerIndex))

[('Group1', 'Index1'),
 ('Group1', 'Index2'),
 ('Group1', 'Index3'),
 ('Group2', 'Index1'),
 ('Group2', 'Index2'),
 ('Group2', 'Index3'),
 ('Group3', 'Index1'),
 ('Group3', 'Index2'),
 ('Group3', 'Index3')]

In [145]:
hierarchy = list(zip(OuterIndex,InnerIndex))
hierarchy = pd.MultiIndex.from_tuples(hierarchy)
hierarchy

MultiIndex([('Group1', 'Index1'),
            ('Group1', 'Index2'),
            ('Group1', 'Index3'),
            ('Group2', 'Index1'),
            ('Group2', 'Index2'),
            ('Group2', 'Index3'),
            ('Group3', 'Index1'),
            ('Group3', 'Index2'),
            ('Group3', 'Index3')],
           )

In [146]:
df2 = pd.DataFrame(randn(9,3),hierarchy,columns=['co1','co2','co3'])
df2

                    co1       co2       co3
Group1 Index1  0.235844  0.192676 -0.170516
       Index2  0.577611  0.602702 -0.573331
       Index3 -0.942340  0.184115  0.930627
Group2 Index1 -0.104217  0.436767 -0.576903
       Index2  0.290545  0.860380 -0.215856
       Index3 -1.432887 -0.398934  0.593868
Group3 Index1  0.449830 -0.202104 -1.196510
       Index2 -0.031668 -0.336042  0.505929
       Index3 -0.339131  0.047761 -0.020171

In [148]:
df2['co3']

Group1  Index1   -0.170516
        Index2   -0.573331
        Index3    0.930627
Group2  Index1   -0.576903
        Index2   -0.215856
        Index3    0.593868
Group3  Index1   -1.196510
        Index2    0.505929
        Index3   -0.020171
Name: co3, dtype: float64

In [157]:
# df2.loc['Group2']
df2.loc[['Group2','Group1']] # same df2.loc[['Group1','Group2']]

                    co1       co2       co3
Group1 Index1  0.235844  0.192676 -0.170516
       Index2  0.577611  0.602702 -0.573331
       Index3 -0.942340  0.184115  0.930627
Group2 Index1 -0.104217  0.436767 -0.576903
       Index2  0.290545  0.860380 -0.215856
       Index3 -1.432887 -0.398934  0.593868

In [162]:
df2.loc['Group2'].loc['Index3']
df2.loc['Group2'].loc['Index3']['co2']

-0.39893377633467464

In [163]:
df2.iloc[2]

co1   -0.942340
co2    0.184115
co3    0.930627
Name: (Group1, Index3), dtype: float64

In [165]:
df2.index.names =['Groups','Indexes']
df2

                     co1       co2       co3
Groups Indexes
Group1 Index1   0.235844  0.192676 -0.170516
       Index2   0.577611  0.602702 -0.573331
       Index3  -0.942340  0.184115  0.930627
Group2 Index1  -0.104217  0.436767 -0.576903
       Index2   0.290545  0.860380 -0.215856
       Index3  -1.432887 -0.398934  0.593868
Group3 Index1   0.449830 -0.202104 -1.196510
       Index2  -0.031668 -0.336042  0.505929
       Index3  -0.339131  0.047761 -0.020171

In [171]:
df2.xs('Group2')
# xs same loc/iloc (both of)

              co1       co2       co3
Indexes
Index1  -0.104217  0.436767 -0.576903
Index2   0.290545  0.860380 -0.215856
Index3  -1.432887 -0.398934  0.593868

In [173]:
df2.xs('Group1').xs('Index1')
df2.xs('Group1').xs('Index1').xs('co2')

0.1926755294065759

In [175]:
df2.xs('Index1',level='Indexes')

             co1       co2       co3
Groups
Group1  0.235844  0.192676 -0.170516
Group2 -0.104217  0.436767 -0.576903
Group3  0.449830 -0.202104 -1.196510

In [179]:
# Lost or Miss Datas
# create a miss data
import numpy as np
arr = np.array([[10,20,np.nan],[3,np.nan,np.nan],[13,np.nan,4]])
# np.nan creating Not a Number value
arr

array([[10., 20., nan],
       [ 3., nan, nan],
       [13., nan,  4.]])

In [181]:
df = pd.DataFrame(arr,index=['Ind1','Ind2','Ind3'], columns=['co1','co2','co3'])
df

       co1   co2  co3
Ind1  10.0  20.0  NaN
Ind2   3.0   NaN  NaN
Ind3  13.0   NaN  4.0

In [183]:
df.dropna()
# If there is at least one 'NaN' in the 'Index' line, it will be deleted.

Empty DataFrame
Columns: [co1, co2, co3]
Index: []

In [184]:
df.dropna(axis=1)
# Not permanent unless you give 'place' value 'True'

       co1
Ind1  10.0
Ind2   3.0
Ind3  13.0

In [188]:
df.dropna(thresh=2) #1,2,3 as you like you can give the num.
# 'Not Deleting if there are at least two smooth data'

       co1   co2  co3
Ind1  10.0  20.0  NaN
Ind3  13.0   NaN  4.0

In [190]:
df.fillna(value=0)#you can use string also

       co1   co2  co3
Ind1  10.0  20.0  0.0
Ind2   3.0   0.0  0.0
Ind3  13.0   0.0  4.0

Let us assume that the structure of the data is appropriate and that the data we are looking for is independent of the mean, and we assign the mean to the 'NaN' values.

In [193]:
df.sum()
df.sum().sum()

50.0

In [198]:
df.fillna(value=(df.sum().sum())/5)
df.fillna(value=(np.var(df))) #or np.std(df)

       co1   co2  co3
Ind1  10.0  20.0  0.0
Ind2   3.0   0.0  0.0
Ind3  13.0   0.0  4.0

In [199]:
df.size

9

In [202]:
df.isnull()
# True mean NaN

        co1    co2    co3
Ind1  False  False   True
Ind2  False   True   True
Ind3  False   True  False

In [206]:
df.isnull().sum() #for each column
df.isnull().sum().sum() #totalt count of NaN

4

In [208]:
df.size - df.isnull().sum() #count of each coulumn not NaN value

co1    9
co2    7
co3    7
dtype: int64

In [0]:
# GroupBy Operatisons

In [0]:
data = {'Job': ['Data Mining','CEO','Lawyer','Lawyer','Data Mining','CEO'],'Labouring': ['Immanuel','Jeff','Olivia','Maria','Walker','Obi-Wan'], 'Salary': [4500,30000,6000,5250,5000,35000]}

In [213]:
df = pd.DataFrame(data)
df

           Job Labouring  Salary
0  Data Mining  Immanuel    4500
1          CEO      Jeff   30000
2       Lawyer    Olivia    6000
3       Lawyer     Maria    5250
4  Data Mining    Walker    5000
5          CEO   Obi-Wan   35000

In [215]:
salaries = df.groupby('Salary')
salaries

In [217]:
salaries.sum()

                Job Labouring
Salary
4500    Data Mining  Immanuel
5000    Data Mining    Walker
5250         Lawyer     Maria
6000         Lawyer    Olivia
30000           CEO      Jeff
35000           CEO   Obi-Wan

In [220]:
# salaries.min()
salaries.max()

                Job Labouring
Salary
4500    Data Mining  Immanuel
5000    Data Mining    Walker
5250         Lawyer     Maria
6000         Lawyer    Olivia
30000           CEO      Jeff
35000           CEO   Obi-Wan

In [221]:
# summary
df.groupby('Salary').sum()

                Job Labouring
Salary
4500    Data Mining  Immanuel
5000    Data Mining    Walker
5250         Lawyer     Maria
6000         Lawyer    Olivia
30000           CEO      Jeff
35000           CEO   Obi-Wan

In [222]:
df.groupby('Job').sum().loc['CEO']

Salary    65000
Name: CEO, dtype: int64

In [224]:
df.groupby('Job').count()

             Labouring  Salary
Job
CEO                  2       2
Data Mining          2       2
Lawyer               2       2

In [230]:
df.groupby('Job').min()
df.groupby('Job').min()['Salary']
df.groupby('Job').min()['Salary']['Lawyer']
df.groupby('Job').mean()['Salary']['CEO']

32500

In [234]:
# Concatenate Merge Ve Join Funcs
# * Concatenate: join proccess
data = {'A': ['A1','A2','A3','A4'],'B': ['B1','B2','B3','B4'],'C': ['C1','C2','C3','C4']}
data1 = {'A': ['A5','A6','A7','A8'],'B': ['B5','B6','B7','B8'],'C': ['C5','C6','C7','C8']}
df1 = pd.DataFrame(data, index = [1,2,3,4])
df2 = pd.DataFrame(data1, index = [5,6,7,8])
df1

    A   B   C
1  A1  B1  C1
2  A2  B2  C2
3  A3  B3  C3
4  A4  B4  C4

In [235]:
pd.concat([df1,df2])

    A   B   C
1  A1  B1  C1
2  A2  B2  C2
3  A3  B3  C3
4  A4  B4  C4
5  A5  B5  C5
6  A6  B6  C6
7  A7  B7  C7
8  A8  B8  C8

In [236]:
pd.concat([df1,df2],axis=1)

     A    B    C    A    B    C
1   A1   B1   C1  NaN  NaN  NaN
2   A2   B2   C2  NaN  NaN  NaN
3   A3   B3   C3  NaN  NaN  NaN
4   A4   B4   C4  NaN  NaN  NaN
5  NaN  NaN  NaN   A5   B5   C5
6  NaN  NaN  NaN   A6   B6   C6
7  NaN  NaN  NaN   A7   B7   C7
8  NaN  NaN  NaN   A8   B8   C8

In [242]:
# * Join
data = {'A': ['A1','A2','A3','A4'],'B': ['B1','B2','B3','B4'],'C': ['C1','C2','C3','C4']}
data1 = {'A': ['A5','A6','A7','A8'],'B': ['B5','B6','B7','B8'],'C': ['C5','C6','C7','C8']}
df1 = pd.DataFrame(data, index = [1,2,3,4])
df2 = pd.DataFrame(data1, index = [5,6,7,8])
df2

    A   B   C
5  A5  B5  C5
6  A6  B6  C6
7  A7  B7  C7
8  A8  B8  C8

In [0]:
data2 = [[1,'K','L'],[2,'M','N'],[6,'O','P'],[7,'Q','R'],[8,'S','T']]
# data2 = np.array(data2) IF YOU WANT U CAN'T USE
# data2.shape

In [256]:
df2 = pd.DataFrame(data2, index = [0,1,2,3,4],columns = ['id', 'Feature1', 'Feature2'])
df2

   id Feature1 Feature2
0   1        K        L
1   2        M        N
2   6        O        P
3   7        Q        R
4   8        S        T

Pandas Join
 DataFrame.join(self, other, on=None, how='left', lsuffix='', rsuffix='', sort=False) → 'DataFrame'[source]

    Join columns of another DataFrame.

    Join columns with other DataFrame either on index or on a key column. Efficiently join multiple DataFrame objects by index at once by passing a list.

    Parameters

        otherDataFrame, Series, or list of DataFrame

            Index should be similar to one of the columns in this one. If a Series is passed, its name attribute must be set, and that will be used as the column name in the resulting joined DataFrame.
        onstr, list of str, or array-like, optional

            Column or index level name(s) in the caller to join on the index in other, otherwise joins index-on-index. If multiple values given, the other DataFrame must have a MultiIndex. Can pass an array as the join key if it is not already contained in the calling DataFrame. Like an Excel VLOOKUP operation.
        how{‘left’, ‘right’, ‘outer’, ‘inner’}, default ‘left’

            How to handle the operation of the two objects.

                left: use calling frame’s index (or column if on is specified)

                right: use other’s index.

                outer: form union of calling frame’s index (or column if on is specified) with other’s index, and sort it. lexicographically.

                inner: form intersection of calling frame’s index (or column if on is specified) with other’s index, preserving the order of the calling’s one.

        lsuffixstr, default ‘’

            Suffix to use from left frame’s overlapping columns.
        rsuffixstr, default ‘’

            Suffix to use from right frame’s overlapping columns.
        sortbool, default False

            Order result DataFrame lexicographically by the join key. If False, the order of the join key depends on the join type (how keyword).

    Returns

        DataFrame

            A dataframe containing columns from both the caller and other.

source: https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.join.html

In [257]:
# Left Join
df1.join(df2)

    A   B   C  id Feature1 Feature2
1  A1  B1  C1   2        M        N
2  A2  B2  C2   6        O        P
3  A3  B3  C3   7        Q        R
4  A4  B4  C4   8        S        T

In [258]:
df2.join(df1)

   id Feature1 Feature2    A    B    C
0   1        K        L  NaN  NaN  NaN
1   2        M        N   A1   B1   C1
2   6        O        P   A2   B2   C2
3   7        Q        R   A3   B3   C3
4   8        S        T   A4   B4   C4

In [259]:
# Right Join
df1.join(df2,how='right')

     A    B    C  id Feature1 Feature2
0  NaN  NaN  NaN   1        K        L
1   A1   B1   C1   2        M        N
2   A2   B2   C2   6        O        P
3   A3   B3   C3   7        Q        R
4   A4   B4   C4   8        S        T

In [260]:
df2.join(df1,how='right')

   id Feature1 Feature2   A   B   C
1   2        M        N  A1  B1  C1
2   6        O        P  A2  B2  C2
3   7        Q        R  A3  B3  C3
4   8        S        T  A4  B4  C4

In [261]:
# Inner Join
df1.join(df2,how='inner') #same element different index for elements df2.join(df1,how='inner')

    A   B   C  id Feature1 Feature2
1  A1  B1  C1   2        M        N
2  A2  B2  C2   6        O        P
3  A3  B3  C3   7        Q        R
4  A4  B4  C4   8        S        T

In [262]:
# Outer Join
df1.join(df2,how='outer') #same element different index for elements df2.join(df1,how='outer')

     A    B    C  id Feature1 Feature2
0  NaN  NaN  NaN   1        K        L
1   A1   B1   C1   2        M        N
2   A2   B2   C2   6        O        P
3   A3   B3   C3   7        Q        R
4   A4   B4   C4   8        S        T

In [264]:
df1.join(df2,sort='True')

    A   B   C  id Feature1 Feature2
1  A1  B1  C1   2        M        N
2  A2  B2  C2   6        O        P
3  A3  B3  C3   7        Q        R
4  A4  B4  C4   8        S        T

In [266]:
df1.join(df2,sort='False')

    A   B   C  id Feature1 Feature2
1  A1  B1  C1   2        M        N
2  A2  B2  C2   6        O        P
3  A3  B3  C3   7        Q        R
4  A4  B4  C4   8        S        T

In [269]:
frames = [df1,df2]
df_keys =pd.concat(frames,keys=['x','y'])
df_keys

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:2: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

       A    B    C Feature1 Feature2   id
x 1   A1   B1   C1      NaN      NaN  NaN
  2   A2   B2   C2      NaN      NaN  NaN
  3   A3   B3   C3      NaN      NaN  NaN
  4   A4   B4   C4      NaN      NaN  NaN
y 0  NaN  NaN  NaN        K        L  1.0
  1  NaN  NaN  NaN        M        N  2.0
  2  NaN  NaN  NaN        O        P  6.0
  3  NaN  NaN  NaN        Q        R  7.0
  4  NaN  NaN  NaN        S        T  8.0

Pandas Merge
pandas.DataFrame.merge

DataFrame.merge(self, right, how='inner', on=None, left_on=None, right_on=None, left_index=False, right_index=False, sort=False, suffixes=('_x', '_y'), copy=True, indicator=False, validate=None) → 'DataFrame'[source]

    Merge DataFrame or named Series objects with a database-style join.

    The join is done on columns or indexes. If joining columns on columns, the DataFrame indexes will be ignored. Otherwise if joining indexes on indexes or indexes on a column or columns, the index will be passed on.

    Parameters

        rightDataFrame or named Series

            Object to merge with.
        how{‘left’, ‘right’, ‘outer’, ‘inner’}, default ‘inner’

            Type of merge to be performed.

                left: use only keys from left frame, similar to a SQL left outer join; preserve key order.

                right: use only keys from right frame, similar to a SQL right outer join; preserve key order.

                outer: use union of keys from both frames, similar to a SQL full outer join; sort keys lexicographically.

                inner: use intersection of keys from both frames, similar to a SQL inner join; preserve the order of the left keys.

        onlabel or list

            Column or index level names to join on. These must be found in both DataFrames. If on is None and not merging on indexes then this defaults to the intersection of the columns in both DataFrames.
        left_onlabel or list, or array-like

            Column or index level names to join on in the left DataFrame. Can also be an array or list of arrays of the length of the left DataFrame. These arrays are treated as if they are columns.
        right_onlabel or list, or array-like

            Column or index level names to join on in the right DataFrame. Can also be an array or list of arrays of the length of the right DataFrame. These arrays are treated as if they are columns.
        left_indexbool, default False

            Use the index from the left DataFrame as the join key(s). If it is a MultiIndex, the number of keys in the other DataFrame (either the index or a number of columns) must match the number of levels.
        right_indexbool, default False

            Use the index from the right DataFrame as the join key. Same caveats as left_index.
        sortbool, default False

            Sort the join keys lexicographically in the result DataFrame. If False, the order of the join keys depends on the join type (how keyword).
        suffixestuple of (str, str), default (‘_x’, ‘_y’)

            Suffix to apply to overlapping column names in the left and right side, respectively. To raise an exception on overlapping columns use (False, False).
        copybool, default True

            If False, avoid copy if possible.
        indicatorbool or str, default False

            If True, adds a column to output DataFrame called “_merge” with information on the source of each row. If string, column with information on source of each row will be added to output DataFrame, and column will be named value of string. Information column is Categorical-type and takes on a value of “left_only” for observations whose merge key only appears in ‘left’ DataFrame, “right_only” for observations whose merge key only appears in ‘right’ DataFrame, and “both” if the observation’s merge key is found in both.
        validatestr, optional

            If specified, checks if merge is of specified type.

                “one_to_one” or “1:1”: check if merge keys are unique in both left and right datasets.

                “one_to_many” or “1:m”: check if merge keys are unique in left dataset.

                “many_to_one” or “m:1”: check if merge keys are unique in right dataset.

                “many_to_many” or “m:m”: allowed, but does not result in checks.

            New in version 0.21.0.

    Returns

        DataFrame

            A DataFrame of the two merged objects.

source: https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.merge.html

In [274]:
# to concat different size datasets
data1 = {'A':['A1','A2','A3'], 'B': ['B1','B2','B3'], 'Key': ['K1','K2','K3']}
data2 = {'X':['X1','X2','X3','X4'], 'Y': ['Y1','Y2','Y3','Y4'], 'Key': ['K1','K2','K3','K4']}
df1 = pd.DataFrame(data1,index = [1,2,3])
df2 = pd.DataFrame(data2,index = [1,2,3,4])
df1

    A   B Key
1  A1  B1  K1
2  A2  B2  K2
3  A3  B3  K3

In [275]:
df2

    X   Y Key
1  X1  Y1  K1
2  X2  Y2  K2
3  X3  Y3  K3
4  X4  Y4  K4

In [277]:
pd.merge(df1,df2,on='Key')

    A   B Key   X   Y
0  A1  B1  K1  X1  Y1
1  A2  B2  K2  X2  Y2
2  A3  B3  K3  X3  Y3

In [283]:
pd.merge(df1,df2,on='Key',how='right') #default is left and left,right,inner,outer...

     A    B Key   X   Y
0   A1   B1  K1  X1  Y1
1   A2   B2  K2  X2  Y2
2   A3   B3  K3  X3  Y3
3  NaN  NaN  K4  X4  Y4

In [285]:
pd.merge(df1,df2,on='Key',how='right', right_index=True) #default is left and left,right,inner,outer...

       A    B Key   X   Y
1.0   A1   B1  K1  X1  Y1
2.0   A2   B2  K2  X2  Y2
3.0   A3   B3  K3  X3  Y3
NaN  NaN  NaN  K4  X4  Y4

In [286]:
pd.merge(df1,df2,on='Key',how='left', left_index=True) #default is left and left,right,inner,outer...

    A   B Key   X   Y
1  A1  B1  K1  X1  Y1
2  A2  B2  K2  X2  Y2
3  A3  B3  K3  X3  Y3

In [284]:
pd.merge(df1,df2,on='Key',how='outer')

     A    B Key   X   Y
0   A1   B1  K1  X1  Y1
1   A2   B2  K2  X2  Y2
2   A3   B3  K3  X3  Y3
3  NaN  NaN  K4  X4  Y4

In [288]:
pd.merge(df1,df2, right_index=True, left_index=True, how='outer')

     A    B Key_x   X   Y Key_y
1   A1   B1    K1  X1  Y1    K1
2   A2   B2    K2  X2  Y2    K2
3   A3   B3    K3  X3  Y3    K3
4  NaN  NaN   NaN  X4  Y4    K4

In [342]:
# DataFrame Operations And Pivot Table
data = {'Column1': [1,2,3,4,5,6], 'Column2': [1000,1000,2000,3000,3000,1000],'Column3': ['Mace Windu','Darth Vader','Palpatine','Kylo Ren','Rey','Obi-Wan']}
df = pd.DataFrame(data)
df

   Column1  Column2      Column3
0        1     1000   Mace Windu
1        2     1000  Darth Vader
2        3     2000    Palpatine
3        4     3000     Kylo Ren
4        5     3000          Rey
5        6     1000      Obi-Wan

In [343]:
df.head()#first 5 elements but you can use head(num)

   Column1  Column2      Column3
0        1     1000   Mace Windu
1        2     1000  Darth Vader
2        3     2000    Palpatine
3        4     3000     Kylo Ren
4        5     3000          Rey

In [344]:
df.tail()#last 5 elements but you can use tail(num)

   Column1  Column2      Column3
1        2     1000  Darth Vader
2        3     2000    Palpatine
3        4     3000     Kylo Ren
4        5     3000          Rey
5        6     1000      Obi-Wan

In [345]:
df.describe()

        Column1      Column2
count  6.000000     6.000000
mean   3.500000  1833.333333
std    1.870829   983.192080
min    1.000000  1000.000000
25%    2.250000  1000.000000
50%    3.500000  1500.000000
75%    4.750000  2750.000000
max    6.000000  3000.000000

In [346]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
Column1    6 non-null int64
Column2    6 non-null int64
Column3    6 non-null object
dtypes: int64(2), object(1)
memory usage: 272.0+ bytes

In [347]:
df['Column2'].unique()

array([1000, 2000, 3000])

In [348]:
df['Column2'].nunique()

3

In [349]:
df['Column2'].value_counts()

1000    3
3000    2
2000    1
Name: Column2, dtype: int64

In [350]:
df[df['Column1']>=2]

   Column1  Column2      Column3
1        2     1000  Darth Vader
2        3     2000    Palpatine
3        4     3000     Kylo Ren
4        5     3000          Rey
5        6     1000      Obi-Wan

In [351]:
df[(df['Column1']>=2) & (df['Column2']==3000)]

   Column1  Column2   Column3
3        4     3000  Kylo Ren
4        5     3000       Rey

In [352]:
def sqr(x):
  return x**2
df['Column2'].apply(sqr)

0    1000000
1    1000000
2    4000000
3    9000000
4    9000000
5    1000000
Name: Column2, dtype: int64

In [353]:
# or
df['Column2'].apply(lambda x:x**2)

0    1000000
1    1000000
2    4000000
3    9000000
4    9000000
5    1000000
Name: Column2, dtype: int64

In [0]:
# update
df['Column2'] = df['Column2'].apply(sqr)

In [355]:
df['Column3'].apply(len)

0    10
1    11
2     9
3     8
4     3
5     7
Name: Column3, dtype: int64

In [361]:
df.drop('Column3',axis=1)

   Column1  Column2
0        1  1000000
1        2  1000000
2        3  4000000
3        4  9000000
4        5  9000000
5        6  1000000

In [362]:
df.index

RangeIndex(start=0, stop=6, step=1)

In [363]:
df.index.names

FrozenList([None])

In [0]:
data = {'Co1':[1,2,3,4,5,6],'Co2':[200,300,200,300,300,400],'Co3':['John Wick','Dart Vader','Joker','Thanos','Harly Quin','Andrew NG']}

In [0]:
df = pd.DataFrame(data,index=[0,1,2,3,4,5])

In [371]:
df.sort_values(by=['Co1','Co3'])

   Co1  Co2         Co3
0    1  200   John Wick
1    2  300  Dart Vader
2    3  200       Joker
3    4  300      Thanos
4    5  300  Harly Quin
5    6  400   Andrew NG

In [373]:
df.sort_values(by=['Co1','Co2'])

   Co1  Co2         Co3
0    1  200   John Wick
1    2  300  Dart Vader
2    3  200       Joker
3    4  300      Thanos
4    5  300  Harly Quin
5    6  400   Andrew NG

In [375]:
df.sort_values('Co2',ascending=True)#descending can use also

   Co1  Co2         Co3
0    1  200   John Wick
2    3  200       Joker
1    2  300  Dart Vader
3    4  300      Thanos
4    5  300  Harly Quin
5    6  400   Andrew NG

In [376]:
df.sort_values('Co2',ascending=False)

   Co1  Co2         Co3
5    6  400   Andrew NG
1    2  300  Dart Vader
3    4  300      Thanos
4    5  300  Harly Quin
0    1  200   John Wick
2    3  200       Joker

In [377]:
df.sort_values('Co2',kind='heapsort') #mergesort,quicksort...

   Co1  Co2         Co3
2    3  200       Joker
0    1  200   John Wick
3    4  300      Thanos
4    5  300  Harly Quin
1    2  300  Dart Vader
5    6  400   Andrew NG

In [379]:
df.sort_values('Co2',na_position='first') #last

   Co1  Co2         Co3
0    1  200   John Wick
2    3  200       Joker
1    2  300  Dart Vader
3    4  300      Thanos
4    5  300  Harly Quin
5    6  400   Andrew NG

In [380]:
df = pd.DataFrame({'Month': ['January','February','March','January','February','March','January','February','March'],'State':['New York','New York','New York','Texas','Texas','Texas','Washington','Washington','Washington'],
'moisture': [20,25,65,34,56,85,21,56,79]})
df

      Month       State  moisture
0   January    New York        20
1  February    New York        25
2     March    New York        65
3   January       Texas        34
4  February       Texas        56
5     March       Texas        85
6   January  Washington        21
7  February  Washington        56
8     March  Washington        79

In [383]:
df.corr()

          moisture
moisture       1.0

In [385]:
# Let's say we have 3 percent humidity in 3 different cities in 3 different months.
df.pivot_table(index='Month',columns='State',values='moisture')

State     New York  Texas  Washington
Month
February        25     56          56
January         20     34          21
March           65     85          79

In [386]:
df.pivot_table(index='State',columns='Month',values='moisture')

Month       February  January  March
State
New York          25       20     65
Texas             56       34     85
Washington        56       21     79

Pandas Read Data


dataset = pd.read_csv ('File_Path \ Data_Name.csv') # You can read this on your IDE on PC.
df = pd.read_csv ("../ input / Data_Name.csv") # Kaggle to write a kernel (but the update is sometimes not working)
dataset.to_csv ('Data_Name') # To convert the data back to csv
excelset = pd.read_excel ('Excels_Name.xlsx') # To read the Excel File
excelset.to_excel ('excelnewfile.xlsx') # Convert to Excel file
New = pd.read_html ('Datasetin urlsi.html') # To read data on the Internet

In [0]:
# Research
# Pandas_Profiling()
# for libs: https://www.scipy.org/